In [1]:
import pandas as pd

In [6]:
df=pd.DataFrame(
    {
        "Name":["Mani","Tiru","Raju","Siri","Priyanka","Santhu"],
        "Gender":["Male","Male","Male","Female","Female","Male"],
        "Branch":["CSE","ECE","ECE","CSE","ECE","CSE"],
        "Marks":[90,92,95,85,83,70]
})

In [7]:
df

       Name  Gender Branch  Marks
0      Mani    Male    CSE     90
1      Tiru    Male    ECE     92
2      Raju    Male    ECE     95
3      Siri  Female    CSE     85
4  Priyanka  Female    ECE     83
5    Santhu    Male    CSE     70

In [8]:
df.max()#returns the maximum value in each coloumn

Name      Tiru
Gender    Male
Branch     ECE
Marks       95
dtype: object

In [7]:
df["Name"]#Returns Max value in the specified coloumn

0        Mani
1        Tiru
2        Raju
3        Siri
4    Priyanka
5      Santhu
Name: Name, dtype: object

In [9]:
df.min()

Name        Mani
Gender    Female
Branch       CSE
Marks         70
dtype: object

In [8]:
df.describe()#Returns stastical data of a Numnerical coloumn

           Marks
count   6.000000
mean   85.833333
std     8.931219
min    70.000000
25%    83.500000
50%    87.500000
75%    91.500000
max    95.000000

In [10]:
df.mean()

C:\Users\A.R.S.MANI KANTHA\AppData\Local\Temp\ipykernel_9488\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Marks    85.833333
dtype: float64

In [9]:
df.info()#Returns the overview of the DataFrame i.e...No of coloumns and non null values and the data type of each columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Gender  6 non-null      object
 2   Branch  6 non-null      object
 3   Marks   6 non-null      int64
dtypes: int64(1), object(3)
memory usage: 320.0+ bytes

In [12]:
df.var()

C:\Users\A.R.S.MANI KANTHA\AppData\Local\Temp\ipykernel_9488\1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

Marks    79.766667
dtype: float64

In [10]:
df.dtypes  #Returns the datatype of each coloumn based on the type of data

Name      object
Gender    object
Branch    object
Marks      int64
dtype: object

In [11]:
df.head(2)  #Returns the top two values of the Selected DataFrame

   Name Gender Branch  Marks
0  Mani   Male    CSE     90
1  Tiru   Male    ECE     92

In [12]:
df.tail(2)  #Returns the last two elements of the selected DataFrame

       Name  Gender Branch  Marks
4  Priyanka  Female    ECE     83
5    Santhu    Male    CSE     70

In [14]:
df.head(3).tail(1) #returns the specific element using head and tail functions....

   Name Gender Branch  Marks
2  Raju   Male    ECE     95

In [27]:
#Creating a series using series function
#..index is a optional parameter to assaign specific index to each value...
df1=pd.Series([1,2,3,4,5],index=[3,4,5,6,7])

In [31]:
df1

3    1
4    2
5    3
6    4
7    5
dtype: int64

In [33]:
#head and tail functions for specific coloumns--->
print(df["Marks"].head(3))
print(df["Name"].tail(3))

0    90
1    92
2    95
Name: Marks, dtype: int64
3        Siri
4    Priyanka
5      Santhu
Name: Name, dtype: object

In [37]:
#type() method is used to return the type variable
print(type(df))#It is a dataFrame Object
type(df["Name"]) #It is a Series created using DataFrame

<class 'pandas.core.frame.DataFrame'>

pandas.core.series.Series

In [39]:
#Returns the number of Rows and Coloumns in the given DataFrame-->shape=(row,coloumn)
print(df.shape)
print(df["Name"].shape)

(6, 4)
(6,)

In [2]:
df1=pd.Series([2,3,4,5,6])
df1

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [3]:
df1.dtypes

dtype('int64')